webm_to_mp4.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-09-19 二 15:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to convert a WebM video to MP4 in GNOME correctly</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="This article describes how to convert a WebM video to MP4 format in GNOME correctly. This is useful if you need to share your video with someone who does not have a WebM player." />
<meta name="keywords" content="WebM, MP4, GNOME, ffmpeg, video conversion" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bulma@0.9.4/css/bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><a href='https://github.com/ChanMo/blog/issues' target='_blank' class='navbar-item'>Comment</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">How to convert a WebM video to MP4 in GNOME correctly</h1>
</header><p>
When you record a video in GNOME, the video will be aved in WebM format.
WebM is a good format for video compression, but is not as widely supported as MP4.
If you need to share your video with someone who does not have a WebM player,
you may need to convert it to MP4 format.
</p>

<p>
The following command will convert a WebM video to MP4 format:
</p>
<div class="org-src-container">
<pre class="src src-bash">ffmpeg -i input.webm output.mp4
</pre>
</div>

<p>
However, this command will create a file that is larger and slower than the
original WebM file.
</p>

<p>
To fix this, you can use the following command:
</p>
<div class="org-src-container">
<pre class="src src-bash">ffmpeg -i input.webm -vf mpdecimate -c:a copy -vsync vfr ouput.mp4
</pre>
</div>

<p>
This command will use the <code>mpdecimate</code> filter to reduce the frame rate of the
video. This will make the file smaller without sacrificing too much quality.
</p>

<p>
The <code>-c:a copy</code> option tells ffmpeg to copy the audio stream from the input file
to the output file without re-encoding it. This will save time and ensure that
the audio quality is not lost.
</p>

<p>
The <code>-vsync vfr</code> option tells ffmpeg to use variable frame rate encoding. This
will ensure that the video plays smoothly on all devices.
</p>

<p>
To use this command, simply replace <code>input.webm</code> with the path to your input
video file and <code>output.mp4</code> with the path to the output video file.
</p>

<p>
For example, to convert the video <code>my_video.webm</code> to MP4 format, you would use
the following command:
</p>
<div class="org-src-container">
<pre class="src src-bash">ffmpeg -i my_video.webm -vf mpdecimate -c:a copy -vsync vfr my_video.mp4
</pre>
</div>

<p>
This will create a new video file called <code>my_video.mp4</code> that is smaller and
faster.
</p>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>